//NLOPEZC1 JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ
//* run on t6031
//TRN    EXEC PGM=DFHCSDUP,REGION=0M,
//             PARM='CSD(READWRITE),PAGESIZE(60),NOCOMPAT'
//STEPLIB  DD DSN=DFH.V5R3M0.CICS.SDFHLOAD,DISP=SHR
//DFHCSD   DD DISP=SHR,DSN=CICS53.CICS01.DFHCSD
//OUTDD    DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 ALTER  TRANSACTION(DAT0) PROGRAM(DATDEMO) GROUP(COMMON)
//*DEFINE TRANSACTION(DAT0) PROGRAM(DATXCICS) GROUP(COMMON)
//*DEFINE PROGRAM(DATXCICS) GROUP(COMMON) DESCRIPTION(DAT DEMO)
