//NLOPEZC1 JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ
//* add a new tran - use DAT0 in T6031 !!!
//TRN    EXEC PGM=DFHCSDUP,REGION=0M,
//             PARM='CSD(READWRITE),PAGESIZE(60),NOCOMPAT'
//STEPLIB  DD DSN=DFH560.CICS.SDFHLOAD,DISP=SHR
//DFHCSD   DD DISP=SHR,DSN=DFH560.CICS.DFHCSD
//OUTDD    DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
DEFINE TRANSACTION(DAT0) PROGRAM(DATXCICS) GROUP(COMMON)
DEFINE PROGRAM(DATXCICS) GROUP(COMMON) DESCRIPTION(DAT DEMO)
