//NLOPEZC1 JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ
//* run on t6031
//TRN    EXEC PGM=DFHCSDUP,REGION=0M,
//             PARM='CSD(READWRITE),PAGESIZE(60),NOCOMPAT'
//STEPLIB  DD DSN=DFH.V5R3M0.CICS.SDFHLOAD,DISP=SHR
//DFHCSD   DD DISP=SHR,DSN=CICS53.CICS01.DFHCSD
//OUTDD    DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DEFINE TRANSACTION(DAT0) PROGRAM(DATDEMO) GROUP(XYZLIST)
  DEFINE PROGRAM(DATDEMO) GROUP(XYZLIST) DESCRIPTION(Nelson zDT Demo Pgm)
  DEFINE PROGRAM(DATMAPM) GROUP(XYZLIST) DESCRIPTION(Nelson zDT Demo Map)
//* ALTER  TRANSACTION(DAT0) PROGRAM(DATDEMO) GROUP(XYZLIST)
//* oprcmds ref  under ibmuser/sys1
//*COMMAND 'F CICSTS56,CEDA INSTALL GROUP(DAT)'           
//*COMMAND 'F CICSTS56,CEMT PERF SHUT IMMED'              
//NOP EXEC PGM=IEFBR14                                    
// COMMAND 'F CICSTS56,CEMT SET PROG(DATDEMO) PHASEIN'    