//NLOPEZDB JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ
//STEP1    EXEC PGM=IKJEFT01
//STEPLIB  DD  DISP=SHR,DSN=DSNC10.SDSNLOAD
//SYSPRINT DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM (DBCG)
  BIND PLAN(DAT)    PKLIST(DAT.*) OWNER(IBMUSER) ACT(REP) ISO(CS)
//*  display DB
/*