//NLOPEZRD JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ
//STEP001  EXEC PGM=IKJEFT01
//STEPLIB  DD  DISP=SHR,DSN=DSNC10.SDSNLOAD
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
    DSN SYSTEM(DBCG)
    RUN PROGRAM(DB2PGM) PLAN(DAT) LIB('NLOPEZ.IDZ.LOAD')
    END
/*