//NLOPEZCP JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ
//STEP1    EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//BATCH    DD  DSN=NLOPEZ.IDZ.LOAD,DISP=SHR
//CICS     DD  DSN=NLOPEZ.IDZ.CICSLOAD,DISP=SHR
//SYSIN    DD  *
  COPYMOD OUTDD=CICS,INDD=BATCH
  SELECT MEMBER=((DATSUB,,R))
/*