         MACRO
&LABEL   MAC3
WTO2     CSECT *
R0       EQU   0
R1       EQU   1                       ADDRESS OF PARM
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12                      BASE REGISTER
R13      EQU   13                      SAVE AREA ADDRESS
R14      EQU   14                      RETURN ADDRESS
R15      EQU   15
         MEND