DATMAP   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,                   X
               STORAGE=AUTO,TIOAPFX=YES,DSATTS=(COLOR,HILIGHT),        X
               MAPATTS=(COLOR,HILIGHT)
DATMLIS  DFHMDI SIZE=(24,80),CTRL=(PRINT,FREEKB)
         DFHMDF POS=(1,24),LENGTH=26,INITIAL='Nelsons Map v3',         X
               ATTRB=(ASKIP,BRT)
         DFHMDF POS=(4,18),LENGTH=26,                                  X
               INITIAL='Test This BMS Build in DBB',                   X
               ATTRB=(ASKIP,NORM),HILIGHT=OFF,COLOR=GREEN
DATMLIS DFHMSD TYPE=FINAL
        END