       ID DIVISION.
       PROGRAM-ID. DATXCICS.
      *
      * a dup of datbatc. Dont ask Not really cics
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY 'hello ball ... - v1.2209'.
           STOP RUN.
